//=============================================================================
//
// リザルト画面処理 [result.cpp]
// Author : 
//
//=============================================================================
#include "result.h"
#include "input.h"
#include "texture.h"
#include "sprite.h"
#include "fade.h"
#include "score.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
static int	g_TextureNo = 0;	// テクスチャ情報
static int	g_TextureBg = 0;
static int  g_TextureEnter = 0;

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT InitResult(void)
{
	g_TextureBg = LoadTexture((char*)"data/TEXTURE/bg.jpeg");

	g_TextureEnter = LoadTexture((char*)"data/TEXTURE/enter.png");

	g_TextureNo = LoadTexture((char*)"data/TEXTURE/score.png");

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitResult(void)
{

}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateResult(void)
{
	if (GetKeyboardTrigger(DIK_RETURN) && GetFadeState() == FADE_NONE)
	{
		SceneTransition(SCENE_TITLE);
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawResult(void)
{
	DrawSpriteLeftTop(g_TextureBg, 0.0f, 0.0f, SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f, 0.0f, 1.0f, 1.0f);

	DrawScore(D3DXVECTOR2(SCREEN_WIDTH / 2 + 150.0f, SCREEN_HEIGHT / 2));
	// １枚のポリゴンの頂点とテクスチャ座標を設定
	DrawSprite(g_TextureNo, SCREEN_WIDTH / 2 - 100.0f, SCREEN_HEIGHT / 2, 300.0f, 300.0f, 0.0f, 0.0f, 1.0f, 1.0f);

	DrawSprite(g_TextureEnter, SCREEN_WIDTH - 50.0f, SCREEN_HEIGHT - 80.0f, 200.0f, 100.0f, 0.0f, 0.0f, 1.0f, 1.0f);
}
